package Глава37_Компоненты_Java_Beans;

import java.beans.*;

public class _1305_1397_Table_JavaBeansAPI_Classes {

/*  Интерфейс

///   Интерфейсы пакета java.beans
|----------------------------|-------------------------------------------------------|
|   AppletInitializer        |   Методы этого интерфейса служат для инициализации    |
|                            |   компонентов JavaBeans, которые являются также       |
|                            |   (в версии JDK 9 не рекомендован к употреблению)     |
|----------------------------|-------------------------------------------------------|
|   BeanInfo                 |   Позволяет разработчику указать сведения о свойствах,|
|                            |   событиях и методах компонентов JavaBeans            |
|----------------------------|-------------------------------------------------------|
|   ExceptionListener        |   Метод этого интерфейса вызывается, когда возникает  |
|                            |   исключение                                          |
|----------------------------|-------------------------------------------------------|
|   PropertyChangeListener   |   Метод этого интерфейса вызывается при изменении     |
|                            |   привязанного свойства                               |
|----------------------------|-------------------------------------------------------|
|   PropertyEditor           |   Объекты классов, реализующих этот интерфейс, дают   |
|                            |   разработчикам возможность изменять и отображать     |
|                            |   значения свойст компонентов JavaBeans               |
|----------------------------|-------------------------------------------------------|
|   VetoableChangeListener   |  Метод этого интерфейса вызывается при изменении      |
|                            |  ограниченного свойства                               |
|----------------------------|-------------------------------------------------------|
|   Visibility               |  Методы этого интерфейса позволяют компонентам Java   |
|                            |  Beans выполнять в тех средах, где отсутствует ГПИ    |
|----------------------------|-------------------------------------------------------|

*/

   AppletInitializer AppInitializer;
   BeanInfo BI;
   Customizer customizer;
   DesignMode DesMode;
   ExceptionListener ExceptListener;
   PropertyChangeListener Listener;
   PropertyEditor PropertyEditor;
   VetoableChangeListener VCListener;
   Visibility visible;

/*
///  Классы пакета java.beans
|-------------------------------|-------------------------------------------------------|
|   BeanDescriptor              |   Предоставляет седения о компонентах JavaBeans       |
|                               |   Позволяет также связывать настройщики с компонентами|
|                               |   JavaBeans                                           |
|-------------------------------|-------------------------------------------------------|
|   Beans                       |   Служит для получения сведенмий о компонентах        |
|                               |   JavaBeans                                           |
|-------------------------------|-------------------------------------------------------|
|   DefaultPersistenceDelegate  |   Служит подклассом, производным от класса            |
|                               |   PersistenceDelegate                                 |
|-------------------------------|-------------------------------------------------------|
|   Encoder                     |                                                       |
|-------------------------------|-------------------------------------------------------|
|   EventHandler                |                                                       |
|-------------------------------|-------------------------------------------------------|
|   EventSetDescriptor          |                                                       |
|-------------------------------|-------------------------------------------------------|
|   IndexPropertyChangeEvent    |                                                       |
|-------------------------------|-------------------------------------------------------|
|                               |                                                       |
|-------------------------------|-------------------------------------------------------|

*/

   BeanDescriptor BD;
   Beans B;
   DefaultPersistenceDelegate DPD;
   IndexedPropertyDescriptor IPD;


}

