package Глава10_Обработка_исключений;

public class _294_296_table {
    void exception(){
        try {}catch(ArithmeticException exception){}
        try {}catch(ArrayIndexOutOfBoundsException e){}
        try {}catch(ArrayStoreException e){}
        try {}catch(ClassCastException e){}
        try {}catch(EnumConstantNotPresentException e){}
        try {}catch(IllegalArgumentException e){}

        //        try {}catch (IllegalCallerException e){
        //        Метод нельзя использовать на законнх основаниях
        //        в вызывающем коде введено в версии JDK 9
        //        }

        try {}catch (IllegalMonitorStateException e){}
        try {}catch (IllegalStateException e){}

        try {}catch (IndexOutOfBoundsException e){}
        try {}catch (NegativeArraySizeException e){}



//                try {}catch (LayerInstantiationException e){
//                Нельзя создать уровень модуля
//                введено в версии JDK 9
//                }

        try {}catch (NullPointerException e){}
        try {}catch (NumberFormatException e){}
        try {}catch (SecurityException e){}
        try {}catch (StringIndexOutOfBoundsException e){}
        try {}catch (TypeNotPresentException e){}
        try {}catch (UnsupportedOperationException e){}
    }

}


/*

Таблица [294;10.1] Подклассы непроверяемх исключений, производимые от класса RunTimeException
и определенные в пакете java.lang

====================================================================================================================
|  ArithmeticalException                 |  Арифметическая ошибка (например деление на нуль)                       |
|----------------------------------------|-------------------------------------------------------------------------|
|  ArrayIndexOutOfBoundsException        |  Выход индекса за пределы массива                                       |
|----------------------------------------|-------------------------------------------------------------------------|
|  ArrayStoreException                   |  Присвоение элементу массива объекту несовместимого типа                |
|----------------------------------------|-------------------------------------------------------------------------|
|  ClassCastException                    |  Неверное поведение типов                                               |
|----------------------------------------|-------------------------------------------------------------------------|
|  EnumConstantNotPresentException       |  Попытка воспользоваться неопределенным значением перечисления          |
|----------------------------------------|-------------------------------------------------------------------------|
|  IllegalArgumentException              |  Употребление недопустимого аргумента при вызове метода                 |
|----------------------------------------|-------------------------------------------------------------------------|
|  IllegalCallerException                |  Нельзя создать уровень модуля введено в версии JDK 9                   |
|----------------------------------------|-------------------------------------------------------------------------|
|  IllegalMonitorStateException          |  Недопустимая контрольная операция (например, ожидание                  |
|                                        |  незаблокированного потока исполнения)                                  |
|----------------------------------------|-------------------------------------------------------------------------|
|  IndexOutOfBoundsException             |  Вход индекса некоторого типа за допустимые пределы                     |
|----------------------------------------|-------------------------------------------------------------------------|
|  NegativeArraySizeException            |  Создание массиа отрицательного размера                                 |
|----------------------------------------|-------------------------------------------------------------------------|
|  LayerInstantiationException           |  Нельзя создать уровень модуля (введено в версии JDK 9)                 |
|----------------------------------------|-------------------------------------------------------------------------|
|  NullPointerException                  |  Неверное использование пустой ссылки                                   |
|----------------------------------------|-------------------------------------------------------------------------|
|  NumberFormatException                 |  Неверное преобразование символьной строки в числовой формат            |
|----------------------------------------|-------------------------------------------------------------------------|
|  SecurityException                     |  Попытка нарушения безопасности                                         |
|----------------------------------------|-------------------------------------------------------------------------|
|  StringIndexOutOfBoundsException       |  Попытка индексации за пределами символьной строки                      |
|----------------------------------------|-------------------------------------------------------------------------|
|  TypeNotPresentException               |  Тип не найден                                                          |
|----------------------------------------|-------------------------------------------------------------------------|
|  UnsupportedOperationException         |  Обнаружена неподдерживаемая операция                                   |
====================================================================================================================


Таблица [294;10.1] Проверяемые исключения, определенные в пакете java.lang

====================================================================================================================
|  ArithmeticalException                 |  Арифметическая ошибка (например деление на нуль)                       |
|----------------------------------------|-------------------------------------------------------------------------|
|  ArrayIndexOutOfBoundsException        |  Выход индекса за пределы массива                                       |
|----------------------------------------|-------------------------------------------------------------------------|
|  ArrayStoreException                   |  Присвоение элементу массива объекту несовместимого типа                |
|----------------------------------------|-------------------------------------------------------------------------|
|  ClassCastException                    |  Неверное поведение типов                                               |
|----------------------------------------|-------------------------------------------------------------------------|

*/





class MyException extends Exception {
    private int detail;
    Thread t = Thread.currentThread();
    static String Demo(){

        try {
            Thread.sleep(12);
        }catch (InterruptedException e){

        }
        return "";
    }

    MyException(int a){
        detail = a;
    }

    public String toString(){


        return "MyException { " + detail + " } " + "\n";
    }

}






